CSI API ETABS v1
cLoadCases Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cLoadCases
Public Interface cLoadCases
Dim instance As cLoadCases
public interface class cLoadCases
type cLoadCases =  interface end
The cLoadCases type exposes the following members.
Properties
Name | Description
Buckling
DirHistLinear
DirHistNonlinear
HyperStatic
ModalEigen
ModalRitz
ModHistLinear
ModHistNonlinear
ResponseSpectrum
StaticLinear
StaticNonlinear
StaticNonlinearStaged
Top
Methods
Name | Description
ChangeName
Count
Delete
 Deletes the specified load case.
GetNameList
 Retrieves the names of all defined load cases of the specified type.
GetTypeOAPI
GetTypeOAPI_1
 Retrieves the case type, design type, and auto flag for the specified load case
SetDesignType
Top
See Also
Reference
ETABSv1 Namespace